# Property Selection Type Enumeration

Source: https://www.revitapidocs.com/2026/25472aa1-01db-d8c1-cd10-2bbde2c442eb.htm

---

| Property Selection Type Enumeration |
| --- |

An enumerated type listing the types of properties to find in the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum PropertySelectionType
```

```
Public Enumeration PropertySelectionType
```

```
public enum class PropertySelectionType
```

```
type PropertySelectionType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| All | 0 | All the properties. |
| Exporting | 1 | The properties that are included in export. |
| NonExporting | 2 | The properties that are not included in export. |

See Also

#### Reference

Autodesk.Revit.DB Namespace